#include "core/bus_HAL.h"
#include "core/powerSave.h"

/***************************************************************************************
** Function name: _setup_gpio()
** Location: main.cpp
** Description:   начальная настройка периферии устройства
***************************************************************************************/

void _setup_gpio() {
    // Включаем режимы выходов для CS (Chip Select) радиомодулей
    pinMode(CC1101_SS_PIN, OUTPUT);
    pinMode(NRF24_SS_PIN, OUTPUT);

    // Блокируем передачу по SPI на старте, чтобы модули не мешали друг другу
    digitalWrite(CC1101_SS_PIN, HIGH);
    digitalWrite(NRF24_SS_PIN, HIGH);

    bruceConfigPins.rfModule = CC1101_SPI_MODULE;
    bruceConfigPins.irRx = RXLED;
}

bool isCharging() {
    // Чипа питания нет, возвращаем, что кабель подключен
    return true; 
}

int getBattery() {
    // Возвращаем стабильные 100% заряда, чтобы прошивка не уходила в спящий режим из-за "разряженной" батареи
    return 100; 
}

/*********************************************************************
** Function: setBrightness
** Управление подсветкой дисплея ILI9341
**********************************************************************/
void _setBrightness(uint8_t brightval) {
    if (brightval == 0) {
        analogWrite(TFT_BL, brightval);
    } else {
        int bl = MINBRIGHT + round(((255 - MINBRIGHT) * brightval / 100));
        analogWrite(TFT_BL, bl);
    }
}

/*********************************************************************
** Function: InputHandler
** Обработчик ввода. Физические кнопки вырезаны, управление идет через Touch Screen
**********************************************************************/
void InputHandler(void) {
    // Логика кнопок отключена. Библиотека тачскрина работает напрямую 
    // через внутренние прерывания и функции самого Bruce Firmware.
    return;
}

/*********************************************************************
** Function: powerOff
** Безопасный перезапуск вместо ухода в глубокий сон
**********************************************************************/
void powerOff() {
    // Так как физической кнопки включения нет, уход в глубокий сон "окирпичит" плату до сброса питания.
    // Вместо этого делаем обычную перезагрузку.
    esp_restart(); 
}

/*********************************************************************
** Function: checkReboot
** Заглушка для проверки удержания кнопок выключения
**********************************************************************/
void checkReboot() {
    // Кнопки отсутствуют, проверка не требуется
    return;
}
